-- Импорт типов партнеров
INSERT INTO partner_types (name) VALUES
('ЗАО'),
('ООО'),
('ПАО'),
('ОАО');

-- Импорт партнеров
INSERT INTO partners (name, partner_type_id, director, email, phone, address, inn, rating) VALUES
('База Строитель', 1, 'Иванова Александра Ивановна', 'aleksandraivanova@ml.ru', '493 123 45 67', '652050, Кемеровская область, город Юрга, ул. Лесная, 15', '2222455179', 7),
('Паркет 29', 2, 'Петров Василий Петрович', 'vppetrov@vl.ru', '987 123 56 78', '164500, Архангельская область, город Северодвинск, ул. Строителей, 18', '3333888520', 7),
('Стройсервис', 3, 'Соловьев Андрей Николаевич', 'ansolovev@st.ru', '812 223 32 00', '188910, Ленинградская область, город Приморск, ул. Парковая, 21', '4440391035', 7),
('Ремонт и отделка', 4, 'Воробьева Екатерина Валерьевна', 'ekaterina.vorobeva@ml.ru', '444 222 33 11', '143960, Московская область, город Реутов, ул. Свободы, 51', '1111520857', 5),
('МонтажПро', 1, 'Степанов Степан Сергеевич', 'stepanov@stepan.ru', '912 888 33 33', '309500, Белгородская область, город Старый Оскол, ул. Рабочая, 122', '5552431140', 10);

-- Импорт типов продукции
INSERT INTO product_types (name, coefficient) VALUES
('Ламинат', 2.35),
('Массивная доска', 5.15),
('Паркетная доска', 4.34),
('Пробковое покрытие', 1.5);

-- Импорт продукции
INSERT INTO products (name, article, product_type_id, min_price) VALUES
('Паркетная доска Ясень темный однополосная 14 мм', '8758385', 3, 4456.90),
('Инженерная доска Дуб Французская елка однополосная 12 мм', '8858958', 3, 7330.99),
('Ламинат Дуб дымчато-белый 33 класс 12 мм', '7750282', 1, 1799.33),
('Ламинат Дуб серый 32 класс 8 мм с фаской', '7028748', 1, 3890.41),
('Пробковое напольное клеевое покрытие 32 класс 4 мм', '5012543', 4, 5450.59);

-- Импорт типов материалов
INSERT INTO material_types (name, defect_percentage) VALUES
('Тип материала 1', 0.10),
('Тип материала 2', 0.95),
('Тип материала 3', 0.28),
('Тип материала 4', 0.55),
('Тип материала 5', 0.34);

-- Импорт продаж
INSERT INTO sales (partner_id, product_id, quantity, sale_date) VALUES
(1, 1, 15500, '2023-03-23'),
(1, 3, 12350, '2023-12-18'),
(1, 4, 37400, '2024-06-07'),
(2, 2, 35000, '2022-12-02'),
(2, 5, 1250, '2023-05-17'),
(2, 3, 1000, '2024-06-07'),
(2, 1, 7550, '2024-07-01'),
(3, 1, 7250, '2023-01-22'),
(3, 2, 2500, '2024-07-05'),
(4, 4, 59050, '2023-03-20'),
(4, 3, 37200, '2024-03-12'),
(4, 5, 4500, '2024-05-14'),
(5, 3, 50000, '2023-09-19'),
(5, 4, 670000, '2023-11-10'),
(5, 1, 35000, '2024-04-15'),
(5, 2, 25000, '2024-06-12');